[AHWElder X2CharacterTemplate]
strCharacterName="Ethereal"

[AHW_Elder_PsiCannon X2WeaponTemplate]
FriendlyName="Transcendent Mind"
FriendlyNamePlural="Transcendent Minds"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is discovered."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="Psionic Lance"

[AHW_Elder_PsiWep X2WeaponTemplate]
FriendlyName="Divine Will"
FriendlyNamePlural="Divine Wills"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is discovered."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="Psionic Decimator"

[AHWElderKillBonus X2AbilityTemplate]
LocFriendlyName="Master Of The Gift"
LocLongDescription="Attacks against Flanked Enemies are Guaranteed to Hit and Crit Non-Untouchable Enemies, but otherwise, basic ranged attacks cannot Crit and have lower than avarage accuracy. Additionally, it is more difficult to critically strike Ethereals."
LocHelpText="Attacks against Flanked Enemies are Guaranteed to Hit and Crit Non-Untouchable Enemies, but otherwise, attacks ranged attacks cannot Crit and have lower than avarage accuracy. Additionally, it is more difficult to critically strike Ethereals."
LocFlyOverText="Master Of The Gift"

[AHWElderImmunity X2AbilityTemplate]
LocFriendlyName="Psionic Shielding"
LocLongDescription="Once Alerted, The Ethereal Forms a Protective Psychic Barrier around themselves, Permanently Immunizing themselves against Acidic, Thermal, Cryogenic, Electrical Weaponry."
LocHelpText="Once Alerted, The Ethereal Forms a Protective Psychic Barrier around themselves, Permanently Immunizing themselves against Acidic, Thermal, Cryogenic, Electrical Weaponry."
LocFlyOverText="Psionic Shielding"

[AHWEtherealDivinity X2AbilityTemplate]
LocFriendlyName="Mind Over Matter"
LocLongDescription="Ethereals Receive 66% reduced damage from Attacks if they've taken been Hit Twice by Attacks in the same turn Turn, and slowly regenerate lost health."
LocHelpText="Ethereals Receive 66% reduced damage from Attacks if they've taken been Hit Twice by Attacks in the same turn Turn, and slowly regenerate lost health."
LocFlyOverText="Mind Over Matter"

[AHWElderCallRNF X2AbilityTemplate]
LocFriendlyName="Our Will Be Done"
LocLongDescription="Summons in Three Two Enemy Squads, with a one turn delay between each squad."
LocHelpText="Summons in Three Two Enemy Squads, with a one turn delay between each squad."
LocFlyOverText="Our Will Be Done"

[AHWElderReflect X2AbilityTemplate]
LocFriendlyName="Psychic Fortress"
LocLongDescription="All Non-Reaction Shots from within the Ethereal's Vision Range that will normally miss will instead be intercepted and Reflected Back at the Attacker. Additionaly, the Ethereal has a 10% chance to intercept attacks that would hit and reflect them. Critical Hits Cannot be Intercepted and Reflected, and Reflected attacks have a flat 40% chance to hit regardless of cover."
LocHelpText="All Non-Reaction Shots from within the Ethereal's Vision Range that will normally miss will instead be intercepted and Reflected Back at the Attacker. Additionaly, the Ethereal has a 10% chance to intercept attacks that would hit and reflect them. Critical Hits Cannot be Intercepted and Reflected, and Reflected attacks have a flat 40% chance to hit regardless of cover."
LocFlyOverText="Psychic Fortress"

[AHWElderReflectShot X2AbilityTemplate]
LocFriendlyName="Psychic Fortress"
LocLongDescription="All Non-Reaction Shots from within the Ethereal's Vision Range that will normally miss will instead be intercepted and Reflected Back at the Attacker. Additionaly, the Ethereal has a 10% chance to intercept attacks that would hit and reflect them. Critical Hits Cannot be Intercepted and Reflected, and Reflected attacks have a flat 40% chance to hit regardless of cover."
LocHelpText="All Non-Reaction Shots from within the Ethereal's Vision Range that will normally miss will instead be intercepted and Reflected Back at the Attacker. Additionaly, the Ethereal has a 10% chance to intercept attacks that would hit and reflect them. Critical Hits Cannot be Intercepted and Reflected, and Reflected attacks have a flat 40% chance to hit regardless of cover."
LocFlyOverText="Psychic Fortress"